# EquivalentDiameter Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DuctPressureDropData..::..EquivalentDiameter Property
DuctPressureDropData Class See Also
---
The equivalent diameter of the duct. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double EquivalentDiameter { get; set; }
```

Visual Basic
---
```text
Public Property EquivalentDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double EquivalentDiameter {
	double get ();
	void set (double value);
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace